import style from '@/app/ui/html/citates.module.css';
import React from 'react';

export default function Citates() {
    return (
        <>
        <div>
            <h1 id="htmlCite">Цитати - </h1>
            22.01.2025. q - <q>короткі цитати</q> (Огортає цитату лапками). blockquote - 
            <blockquote cite="https://w3schoolsua.github.io/html/html_quotation_elements.html#gsc.tab=0">
            визначає розділ що цитується з іншого джерела.</blockquote> Джерело вказується
            в атрибуті cite. abbr - <abbr>абривіатура або акронім.</abbr> В атрибуті title 
            вказується розшифровка. cite - <cite>назва книги, фільму, пісні, тощо.</cite>
            <address>визначає контактну інформацію автора, авторки, журналу...</address> 
            (зазвичай відображається курсивом). bdo - <bdo dir="rtl">.визначає напрямок 
            тексту</bdo> Атрибут dir вказує напрямок тексту. Коментарі описані в підручнику
            не працюють тут. Можна пошукати як вони створюються в Next.js, та вони 
            мені поки не потрібні. Далі по підручнику кольори, але це скоріше для CSS.Тож 
            я лиш напишу що вони можуть вказуватись в RGB, HEX, HSL, RGBA, HSLA, або можна 
            написати назву кольору (Orange, Red, Black...). Я схиляюсь до RGBA, можливо 
            через мій досвід з Unreal Engine. 
        </div>
        <div className={style.greyBackground}>
        CSS: атрибут style вказує стиль елемента і 
        має різноманітні властивості для визначення стилю сторінки, або у випадку з 
        global.css для всього сайту. Для стилізації цього блоку я використав: <ul>
            <li>background-color:rgba(128, 128, 128, 0.5);</li>
            <li>font-size: 16.5px;</li>
            <li>border: 1px solid black;</li>
            <li>border-radius: 10;</li>
            <li>padding: 2px;</li>
            <li>padding-left: 5px;</li>
            <li>margin: 2px;</li>
        </ul>  Я хотів би якось стилізувати список і описати як я це зробив в цьому ж блоку, 
        збоку, але я ще не знаю як розміщати блоки горизонтально один відносно іншого. В 
        цьому сенсі мені подобається Flutter з його Row та Column.
        Також мені не дуже довподоби використання пікселів, але якщо тут так треба то буду 
        просто перебирати їх значеня поки не побачу результат що мене влаштовує. 
        </div>
        <div>
            а - посилання на стронні ресурси. Link - посилання всередині сайту. href - 
            атрибут в якому адреса. target - вказує як відкривати посилання (_blank - 
            нове вікно або вкладка, _self - в тому ж вікні, _parent - в батьківському, top - 
            відкриває пов&#39;язаний документ в повному тілі вікна (щоб це не значило...)). 
            Можна використовувати зображення як посилання, для цього зображення вкладають в 
            посилання. У посилань також є атрибут title. Закладки для сьорфингу по одній, 
            великій сторінці, можна створити за допомогою атрибута id. Тоді посилатись на 
            ідентифікатор можна за допомогою # (href=&#34;#identifier&#34;). Також можна перейти 
            до закладки з іншої сторінки (href=&#34;page.html#identifier&#34;).<br /> 
        </div>
        </>
    );
}