import React from 'react';
import style from "@/app/ui/html/code.module.css";

export default function CodeElement() {
    return (
        <>
        <h1 id="htmlPCCode">Елементи компьютерного коду</h1>
        <b>kbd</b> - елемент введення (не зрозумів що це і як працює...). <b>samp</b> - елемент 
        що представляє вихідні данні (поки що не знаю що воно таке). <b>code</b> - визначає 
        елемент компьютерного коду. <b>var</b> - змінні. 
        <h2 id="htmlSemantics">Семантичні елементи</h2>
        Семантичні елементи це ті елементи що описують свій зміст. Такі як form, table i 
        article. <b>section</b> - тематичне угрупування контенту, зазвичай з заголовком. <b>
        article</b> - автономний контент, типу чату і т.д. <b>header</b> - контейнер для 
        вступного контенту. Зазвичай містить заголовки, лого або іконку, інформацію про 
        авторство. <b>footer</b> - нижній колонтитул. Зазвичай містить інформацію про авторство, 
        інформацію про авторські права, контактну інформацію, мапу сайту, посилання повернення 
        вгору, пов&#39;язані документи. <b>nav</b> - навігація. <b>aside</b> - визначає деякий 
        контент в який поміщений (<a 
        href="https://w3schoolsua.github.io/htmltryit/tryhtml5_aside2.html">приклад</a>).  
        <b>figure</b> i <b>figcaption</b> - в прикладі в елемент figure вписані img - картинка 
        і figcaption - опис картинки. 
        <h2 id="htmlStyle">Гід по стилю</h2>
        29.01.2025. <a href="https://w3schoolsua.github.io/html/html5_syntax.html#gsc.tab=0">
        Можна ознайомитись тут</a>. Більшість рекомендацій зводиться до того що варто робити 
        так як в XHTML. Тож вірогідно можна було одразу вчити саме його...
        <h2 id="htmlEntities">Сутності</h2>
        Деякі символи зарезервовані мовою, або мовами. Тому в прикладах коду я не міг написати 
        фігурні лапки. Щоб мати можливість відобразити на сторінці ці символи існують сутності. 
        вони виглядають як & символьне ім&#39;я або &# символьне число. Також в таких цілях 
        використовують дисяткове або шіснадцяткове позначення. Я загуглив UTF-8 і схоже що 
        фігурні лапки в такому випадку мають виглядати як & 123 i & 125, і якщо написати символ
        і цифру разом то отримаємо: &123 i &125 відповідно. Перша спроба провальна, спробую з 
        символом # i отримаю &#123 i &#125. Знову не працює... Хочь в підручнику на цьому не 
        акцентували увагу та виявляється що треба завершувати крапкою з комою. Тобто треба 
        писати символ & потім Dec або Hex значення з таблиці, потім ; і це все разом. Щоб 
        отримати &1F605; то так і треба написати. Цікаво що в коді це стало синім, типу 
        натякаючи що це вже не просто цифри і значки, а на сторінці це все ще значки і цифри.
        А десяткове значення в свою чергу &128517; теж залишається символами і цифрами, але в 
        коді воно синеньке. Піду пошукаю де там прописати що я використовую UTF-8. Дописав в
        layout, не допомогло. Я можу скопіювати з браузера і вставити в код ось це: ¥. І воно 
        відображається і в коді і на сторінці правильно. Але якщо я намагався на сторінці 
        показати мій CSS код, то отримував помилки через те що фігурні лапки сприймались як 
        якась команда чи щось таке... Я можу в редакторі писати смайли і отримувати їх на 
        сторінці, але не можу вивести на сторінку те що мені треба 😅... Виходить що цей 
        урок майже абсолютно безкорисний для мене... Навіть pre (редагований текст) з цим не 
        допомагає. З&#39;явилась думка що я втрачаю певні можливості, якщо користуюсь Next.js або 
        React в доповнення до звичайного HTML. 
        <div className={style.symboles}>&#123; Але якщо використовувати десяткову систему і 
            писати &# потім числове значення і завершити це крапкою з комою ; то результат на 
            сторінці. Дуже добре що я не змирився зі своїм першим висновком &#125;</div> 
        <h2 id="htmlURL">URL</h2>
        scheme://prefix.domain:port/path/filename - де: <b>scheme</b> - визначає тип 
        Інтернет-сервісу (найбільш розповсюдженими є http та https). <b>prefix</b> - 
        визначає домен (за умовчанням у http є www). <b>domain</b> - визначає Інтернет-доменне 
        ім&#39;я. <b>port</b> - номер порта на хості (за умовчанням для http є 80). <b>path</b> - 
        шлях на сервері. <b>filename</b> назва документа або ресурсу.
        <h2>HTML та XHTML</h2>
        <b>XHTML</b> - це суворіша версія HTML, що базується на XML. <b>XML</b> - мова 
        розмітки в якій усі докумнети мають бути правильно розмічені.  
        </>
    );
}