import styles from '@/app/ui/html-css.module.css'
import React from 'react';

export default function HtmlWithCSS() {
    return (
        <div>
            <h1 className={styles.myTitle}>Html with CSS</h1>
            21.01.2025 h1...h6 заголовки мають атрибут style, font-size:Npx (де N це розмір 
            в пікселях на що вказує &#34;px&#34;) властивість яку часто використовують. Але схоже що 
            в Next.js (або саме в цьому проекті...) я не можу використовувати підхід описаний 
            на сайті <a href="https://w3schoolsua.github.io/html/html_headings.html#gsc.tab=0">
            w3schools.com...</a> , a Tailwind що використовується в підручнику з якого я 
            починав цей проект мені не подобається як інструмент. Тож мені потрібен час щоб 
            розібратись з тим, як мені продовжити навчання. Створив теку ui в app, 
            створив файл global.css що містить в собі стилі для всього проекту (залишив 
            його пустим), імпортував його в layout.tsx. Також створив home.module.css файл
            в ui теці (залишив пустим). Ідея модулів здалась мені гарною. Це все з 
            підручника: <a href="https://nextjs.org/learn/dashboard-app/css-styling">   
            з якого я почав цей сайт</a>. Тож я використав нові знання створивши в ui 
            html-css.module.css, написав там .myTitle в ньому font-size: 35px;(пропущені 
            фігурні лапки!) імпортував його в файл в якому я пишу цей текст і додав 
            className=styles.myTitle(пропущені фігурні лапки!) до h1. 35px очевидно більше 
            ніж стандартний розмір заголовку h1. Пропускав фігурні лапки через особливість 
            HTML. Купа часу на такі дрібниці пішла...<br />
            pre - форматований текст, як написаний в коді так буде і на сторінці, враховуючі 
            пробіли і переноси. <hr /> hr - горизонтальний роздільник використаний вище.
            <h3>Властивості style:</h3> font-size, font-family (шрифти), text-align (
            вирівнюваня тексту), color, background-color. <br /> 
            Форматування тексту, властивості style: b - <b>жирний</b>, strong - <strong>
            важливий</strong> (теж жирний), i - <i>курсив</i>, em - <em>важливий</em> (теж 
            курсив), ins - <ins>вставлений</ins> (підхреслений), del - <del>видалений</del> 
            (захреслений), mark - <mark>маркований</mark> (фон жовтий), small - <small>
            зменшений текст</small>, sub - <sub>підрядковий текст</sub>, sup - <sup>
            надрядковий текст</sup>.             
        </div>
    );
}