import React from 'react';

export default function StartToAtributes() {
    return (
        <div>
                <h3 id="htmlStartAtributes">Start-Atributes</h3> 
                Стандартні і обов&#39;язкові Теги: !DOCTYPE html, html, 
                head (містить метаінформацію, я поки не знаю що це таке), 
                title (назва документа), body
                <p>Тег: p - параграф. h1-h6 - Заголовки. а - посилання 
                    у випадку Next.js це посилання на зовні сайту, всередині 
                    для переміщення між сторінками використовується Link 
                    (атрибут href використовується в обох випадках). img - зображення, 
                    атрибути: src - шлях до зображення, alt - текст який відображається якщо
                    не відображається зображення, width та height - розміри зображення. 
                    button - кнопка. br / - перенос рядка (не має вмісту і відповідно не має 
                    закриваючого елементу). <br /> Списки: ul, ol - невпорядкований і 
                    впорядкований списки, відповідно. li - елемент списку. table - таблиця, 
                    tr - рядок таблиці. <br />
                </p>
                    Атрибути: style - є часто використовуваним, містить CSS. 
                <div title="Тут використаний div і до нього атрибут title">
                    title - відображає підсказки при наведенні вказівника</div>
                    id - ідентифікатор елемента, class (в Next.js className) - елементу 
                    надається ім&#39;я, кілька елементів можеть мати однакові імена. Імена 
                    використовуються в CSS та JS (я планую використовувати TypeScript).
            </div>
    );
}